package num2fa_test

import (
	"github.com/siyanew/num2fa"
	"testing"
)

func TestNum2fa(t *testing.T) {
	testCases := []struct {
		input    int
		expected string
	}{
		{0, "صفر"},
		{1, "یک"},
		{10, "ده"},
		{11, "یازده"},
		{20, "بیست"},
		{21, "بیست و یک"},
		{100, "صد"},
		{101, "صد و یک"},
		{110, "صد و ده"},
		{111, "صد و یازده"},
		{120, "صد و بیست"},
		{123, "صد و بیست و سه"},
		{1000, "یک هزار"},
		{1001, "یک هزار و یک"},
		{1020, "یک هزار و بیست"},
		{1100, "یک هزار و صد"},
		{1123, "یک هزار و صد و بیست و سه"},
		{10000, "ده هزار"},
		{10001, "ده هزار و یک"},
		{12345, "دوازده هزار و سیصد و چهل و پنج"},
		{100000, "صد هزار"},
		{100001, "صد هزار و یک"},
		{123456, "صد و بیست و سه هزار و چهارصد و پنجاه و شش"},
		{1000000, "یک میلیون"},
		{10000000, "ده میلیون"},
		{100000000, "صد میلیون"},
		{1000000000, "یک میلیارد"},
		{-1234567890, "منفی یک میلیارد و دویست و سی و چهار میلیون و پانصد و شصت و هفت هزار و هشتصد و نود"},
	}

	for _, tc := range testCases {
		if actual := num2fa.Convert(tc.input); actual != tc.expected {
			t.Errorf("Num2fa(%d) = %s; expected %s", tc.input, actual, tc.expected)
		}
	}
}
